Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/Atmel.SAME54_DFP.pdsc
      <condition id="ATSAME54P20A">
         <require Dvendor="Atmel:3" Dname="ATSAME54P20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54P19A">
         <require Dvendor="Atmel:3" Dname="ATSAME54P19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N20A">
         <require Dvendor="Atmel:3" Dname="ATSAME54N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N19A">
         <require Dvendor="Atmel:3" Dname="ATSAME54N19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME54P20A">
         <description>Headers and startup code for Atmel ATSAME54P20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54p20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54p20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same54.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same54.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54p20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54p20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME54P19A">
         <description>Headers and startup code for Atmel ATSAME54P19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54p19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54p19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same54.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same54.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54p19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54p19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME54N20A">
         <description>Headers and startup code for Atmel ATSAME54N20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same54.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same54.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54n20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME54N19A">
         <description>Headers and startup code for Atmel ATSAME54N19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same54.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same54.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same54n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same54n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same54.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same54.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same54.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same54.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same54n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same54n19a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
